let x; /* оголошуємо змінну x */
x = 1; /* надаємо значення змінній x' */
let y = 2;  /* оголошуємо змінну y */
console.log("x:", x); /* виводимо х в консоль */
console.log("y before", y); /* виводимо попереднє значеня у в консоль */
y = 42; /* надаємо значення змінній x */
console.log("y after", y); /* виводимо наступне значення у в консоль */
y = "привіт, консоль!"; /* надаємо змінній у значення тексту */
console.log(y); /* виводимо змінну у */
y = true; /* присвоюємо булевське значення у */
console.log("Boolean y:", y); /* виводимо булевське значення у */